using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace dz_6_dop
{
    internal class Program
    {
        static void Main(string[] args)
        {
        //    Урок #6
        //    Массивы:
        //    одномерные
        //    многомерные
        //    Задание: (отправить мне в лс)
        //    1.Написать программу, исчисляющую прибыль фирмы за 6 месяцев.Пользователь вводит прибыль фирмы за каждый месяц.
        //    2.Пользователь вводит прибыль фирмы за год(12 месяцев).Необходимо определить месяц, в котором прибыль была
        //      максимальной и месяц, в котором прибыль была минимальной.
        //    3.Сжать(сдвинуть элементы) массив, удалив из него все 0, и заполнить освободившиеся справа справа значениями -1.
        //      (Нужно сделать через пересоздание массива)
        //    4.Создать матрицу 10 на 10, заполнить рандомными значениями от 10 до 99
        //    вывести на экран:
        //    - вывести сумму чисел главной диагонали матрицы
        //    - вывести минимальное и максимальное значение побочной диагонали матрицы
        //    – ввести с клавиатуры порядковый номер столбца – вывести цифры из этого столбца на экран(аналогично сделать со строкой)
        //    – ввести с клавиатуры порядковый номер одного столбца и затем другого столбца и поменять их местами в матрицу(аналогично сделать со строкой)
        }
    }
}
