using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp2
{
    internal class Program
    {
        enum ChoosingHomework
        {
            dz1 = 1,
            dz2,
            dz3,
            dz4,
            dz5
        }


        public static int ConversionToDegree(int number, int degree)
        {
            if (degree == 0) return 1;
            //Интуитивное объяснение
            //Возведение в степень 0 можно представить как отсутствие множителей.
            //Когда мы умножаем число на себя 0 раз, это означает, что у нас нет 
            //множителей, и результат по определению должен быть 1.
            //Это также делает математические операции более удобными и последовательными.
            //Эти объяснения показывают, почему любое ненулевое число в степени 0 равно 1.
            //https://www.youtube.com/watch?v=J-gBUAUdouI&ab_channel=AlbertLavrov

            int[] numm = new int[2];

            numm[0] = number;
            numm[1] = degree;
            int[] numm1 = new int[2];
            numm1[0] = numm[0];

            for (int i = 1; i < numm[1]; i++)
            {
                numm1[0] = numm[0] * numm1[0];
            }
            return numm1[0];
        }    // Функция dz 1
        static int SumOfNumbersInRange(int num1, int num2)
        {
            if (num1 > num2)
            {
                int[] number = new int[2];
                number[0] = num2;
                number[1] = num1;

                int[] rezalt = new int[number[1]];
                var p = 1;
                for (int i = 0; rezalt[i] < number[1];)
                {
                    rezalt[i] += p;
                    p++;
                    i++;
                    if (i == number[1]) break;

                }
                var o = 0;
                for (int i = 0; i < number[1]; i++)
                {
                    o = rezalt[i] + o;
                }
                return o;
            }
            else
            {
                int[] number = new int[2];
                number[0] = num1;
                number[1] = num2;

                int[] rezalt = new int[number[1]];
                var p = 1;
                for (int i = 0; rezalt[i] < number[1];)
                {
                    rezalt[i] += p;
                    p++;
                    i++;
                    if (i == number[1]) break;

                }
                var o = 0;
                for (int i = 0; i < number[1]; i++)
                {
                    o = rezalt[i] + o;
                }
                return o;
            }
        }              // Функция dz 2
        static void PerfectNumbersInARange(int num1, int num2)
        {
            //все совершеные числа диапазона int
            int[] perfect_numbers = new int[4];
            perfect_numbers[0] = 6;
            perfect_numbers[1] = 28;
            perfect_numbers[2] = 496;
            perfect_numbers[3] = 8128;
            //перебор диапазона int от 0 до 2147483647  
            for (; num1 <= num2; num1++)
            {
                if (num1 == perfect_numbers[0]) Console.WriteLine(perfect_numbers[0]);
                if (num1 == perfect_numbers[1]) Console.WriteLine(perfect_numbers[1]);
                if (num1 == perfect_numbers[2]) Console.WriteLine(perfect_numbers[2]);
                if (num1 == perfect_numbers[3]) Console.WriteLine(perfect_numbers[3]);
            }
        }          // Функция dz 3
        static void СardЫelection(string[] cards, int number)
        {
            if (number >= 0 && number < cards.Length)
            {
                Console.WriteLine($"Карта:\n\n {cards[number]}");
            }
            else
            {
                Console.WriteLine("Ошибка. Неправильный номер карты.");
            }
        }           // Функцыя dz 4
        static void LuckySixDigitNumber(int number)
        {
            var num1 = number / 1000;
            int[] variable = new int[3];
            variable[0] = num1 / 100;
            variable[1] = (num1 / 10) % 10;
            variable[2] = num1 % 10;
            var summ = variable[0] + variable[1] + variable[2];

            var num2 = number - (num1 * 1000);
            int[] variable2 = new int[3];
            variable2[0] = num2 / 100;
            variable2[1] = (num2 / 10) % 10;
            variable2[2] = num2 % 10;
            var summ1 = variable2[0] + variable2[1] + variable2[2];

            if (summ == summ1) Console.WriteLine($"Число :" + num1 + num2 + " счастливое   ");
            else if (summ != summ1) Console.WriteLine($"Число :" + num1 + num2 + " не счастливое");

        }                     // Функцыя dz 5




        static void Main(string[] args)
        {
            ChoosingHomework ChoosingHomework;
            while (true)
            {
                Console.ResetColor();
                try
                {
                    Console.Clear();
                    Console.WriteLine("Выбор домашней работы:\n" +
                                      "1)Степень     числа\n" +
                                      "2)Сумму       чисел\n" +
                                      "3)Совершенные числа\n" +
                                      "4)Карты\n" +
                                      "5)Счастливые  числа ");
                    ChoosingHomework = (ChoosingHomework)Convert.ToInt16(Console.ReadLine());
                    switch (ChoosingHomework)
                    {
                        case Program.ChoosingHomework.dz1:

                            while (true)
                            {

                                Console.Clear();
                                try
                                {
                                    Console.WriteLine("Задание 1.\n" +
                                                      "Написать функцию,которая принимает два параметра:\n" +
                                                      "основу степени и показатель степени и вычисляет \n" +
                                                      "степень числа на основе полученных данных.\n\n");
                                    Console.Write("Введите число    :");
                                    var num = Convert.ToInt32(Console.ReadLine());
                                    Console.Write("Ввдите степеь    :");
                                    var deg = Convert.ToInt32(Console.ReadLine());

                                    Console.WriteLine("Число в степени  :" + ConversionToDegree(num, deg));


                                    Console.WriteLine("\n\nВыйти      нажмите :1\n" +
                                                      "Продолжить нажмите :2");
                                    int r = Convert.ToInt32(Console.ReadLine());
                                    if (r == 1) break;
                                }
                                catch (Exception)
                                {
                                    Console.WriteLine("Ошибка : Укажите число");
                                    Console.ReadKey();

                                }
                            }
                            break;
                        case Program.ChoosingHomework.dz2:
                            while (true)
                            {
                                Console.Clear();
                                try
                                {
                                    Console.WriteLine("Задание 2.\n" +
                                    "Написать функцию, которая получает в качестве параметров 2 целых числа\n" +
                                    "и возвращает сумму чисел из диапазона между ними.\n\n");

                                    Console.Write("Введите первое число диапазона :");
                                    var numm = Convert.ToInt32(Console.ReadLine());
                                    Console.Write("Введите второе число диапазона :");
                                    var num1 = Convert.ToInt32(Console.ReadLine());

                                    Console.Write("Сумма чисел =" + SumOfNumbersInRange(numm, num1));

                                    Console.WriteLine("\n\nВыйти      нажмите :1\n" +
                                                      "Продолжить нажмите :2");
                                    int r = Convert.ToInt32(Console.ReadLine());
                                    if (r == 1) break;
                                }
                                catch (Exception)
                                {
                                    Console.WriteLine("Ошибка");
                                    Console.ReadLine();

                                }


                            }

                            break;
                        case Program.ChoosingHomework.dz3:
                            while (true)
                            {

                                Console.Clear();
                                try
                                {
                                    Console.WriteLine("Задание 3.\nЧисло называется совершенным, если сумма всех его делителей равна ему самому.\nУкажите функцию поиска таких чисел во введенном интервале.\n\n");
                                    Console.WriteLine("Функция вывода совершенных чисел диапазона int от 0 до 2147483647  \n\n ");
                                    Console.Write("Введите первое число диапазона :");
                                    var numm1 = Convert.ToInt32(Console.ReadLine());
                                    Console.Write("Введите второе число диапазона :");
                                    var numm2 = Convert.ToInt32(Console.ReadLine());

                                    PerfectNumbersInARange(numm1, numm2);
                                    Console.WriteLine("\n\nВыйти      нажмите :1\n" +
                                                      "Продолжить нажмите :2");
                                    int r = Convert.ToInt32(Console.ReadLine());
                                    if (r == 1) break;

                                }
                                catch (Exception)
                                {

                                    Console.WriteLine("\n\nОшибка: веденно некоректное значение или выход за предел диапазона от 0 до 2147483647 \n" +
                                                      "ахаха : крутое  объяснение ошибки :) лучше не придумать :) ");
                                    Console.ReadLine();


                                }
                            }

                            break;
                        case Program.ChoosingHomework.dz4:

                            while (true)
                            {
                                Console.BackgroundColor = ConsoleColor.White;
                                Console.Clear();
                                Console.ForegroundColor = ConsoleColor.Black;

                                string[] cards =
                                {
                                        "╔══════════════════════════════╗\n ║ A                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          A║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 2                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          2║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 3                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          3║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 4                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          4║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 5                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          5║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 6                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          6║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 7                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          7║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 8                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          8║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 9                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          9║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 10                          ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                         10║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ J                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          J║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ Q                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          Q║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ K                           ♥║\n ║                              ║\n ║          ────────            ║\n ║          │ ♥  ♥ │            ║\n ║          │  ♥   │            ║\n ║          │ ♥  ♥ │            ║\n ║          ────────            ║\n ║  ♥                          K║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ A                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          A║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 2                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          2║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 3                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          3║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 4                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          4║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 5                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          5║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 6                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          6║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 7                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          7║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 8                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          8║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 9                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          9║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 10                          ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                         10║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ J                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          J║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ Q                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          Q║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ K                           ♦║\n ║                              ║\n ║          ────────            ║\n ║          │ ♦  ♦ │            ║\n ║          │  ♦   │            ║\n ║          │ ♦  ♦ │            ║\n ║          ────────            ║\n ║  ♦                          K║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ A                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          A║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 2                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          2║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 3                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          3║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 4                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          4║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 5                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          5║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 6                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          6║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 7                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          7║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 8                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          8║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 9                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          9║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 10                          ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                         10║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ J                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          J║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ Q                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          Q║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ K                           ♣║\n ║                              ║\n ║          ────────            ║\n ║          │ ♣  ♣ │            ║\n ║          │  ♣   │            ║\n ║          │ ♣  ♣ │            ║\n ║          ────────            ║\n ║  ♣                          K║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ A                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          A║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 2                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          2║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 3                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          3║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 4                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          4║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 5                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          5║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 6                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          6║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 7                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          7║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 8                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          8║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 9                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          9║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ 10                          ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                         10║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ J                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          J║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ Q                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          Q║\n ╚══════════════════════════════╝\n ",
                                        "╔══════════════════════════════╗\n ║ K                           ♠║\n ║                              ║\n ║          ────────            ║\n ║          │ ♠  ♠ │            ║\n ║          │  ♠   │            ║\n ║          │ ♠  ♠ │            ║\n ║          ────────            ║\n ║  ♠                          K║\n ╚══════════════════════════════╝\n ",


                                    };
                                Console.WriteLine("░░░░░░░░░▄▄▄▄▄▄▄▄████▄▄▄▄░░░░░░░░░░░░░\r\n░░░░░░▄▄█▀▀▀▀░░░░░█░░░░▀▀▀▀██▄▄░░░░░░░\r\n░░░▄█▀▀░██░░░░░░░█▀░░░░░░░░▄███░░░░░░░\r\n▄█▀▀░░░░██░░░░░█▄█░░░░░▄░▄█▀░░▀█▄░░░░░\r\n░▀█░░░░███░░░▄███▀░░▄████▀░░░░░░▀█▄░░░\r\n░░▀█░░░░██░░▀████░░▀███▀░▄▄░░░░░░░█▄░░\r\n░░░▀█▄░████░░░░█▀▄▄█▀▀░░████▄░░░░░░▀█▄\r\n░░░░░█▄░▀▀█░░░▄████▄░░░░██████░░░▄█▀▀░\r\n░░░░░░█▄░░█░░░██▀▀█░░░░░▀▀▀▀▀▀░▄█▀░░░░\r\n░░░░░░░▀█░██▄▄█░░██▄░░░░░░░░░▄█▀░░░░░░\r\n░░░░░░░░▀█▄██▀░░▄█▄██▄░░░░░▄█▀░░░░░░░░\r\n░░░░░░░░░█▀░░░░░█░▀░░██▄▄▄█▀░░░░░░░░░░\r\n░░░░░░░░░█░░░░░░█░░░▀░░█▀░░░░░░░░░░░░░\r\n░░░░░░░░░█░░░░░░█░░░░▄█▀░░░░░░░░░░░░░░\r\n░░░░░░░░░█▄░░░░░▀░░░░█░░░░░░░░░░░░░░░░\r\n░░░░░░░░░▄█░░░░░░░░░█▀░░░░░░░░░░░░░░░░\r\n░░░░░░░░███▄▄▄░░░░░▄▀░░░░░░░░░░░░░░░░░\r\n░░░░░░░▀████████▄▄█▀░░░░░░░░░░░░░░░░░░\r\n░░░░░░░░░░▀▀▀█████▄░░░░░░░░░░░░░░░░░░░\r\n\r\n ");
                                Console.WriteLine($"Укажите индекс карты (начиная с 0 до {cards.Length-1}):");
                                int number = int.Parse(Console.ReadLine());
                                СardЫelection(cards, number);

                                Console.WriteLine("\n\nВыйти      нажмите :1\n" +
                                                  "Продолжить нажмите :2");
                                int r = Convert.ToInt32(Console.ReadLine());
                                if (r == 1)
                                {
                                    Console.ResetColor();
                                    break;
                                }

                            }
                            break;
                        case Program.ChoosingHomework.dz5:
                            while (true)
                            {
                                Console.Clear();
                                Console.WriteLine("Задание 5. Написать функцию, определяющую, является ли «счастливым» шестизначное число.\n");
                                try
                                {
                                    var rezalt = Convert.ToInt32(Console.ReadLine());

                                    if (100000 <= rezalt && rezalt <= 999999)
                                    {
                                        LuckySixDigitNumber(rezalt);
                                        Console.WriteLine("\n\nВыйти      нажмите :1\n" +
                                                 "Продолжить нажмите :2");
                                        int r = Convert.ToInt32(Console.ReadLine());
                                        if (r == 1)
                                        {
                                            Console.ResetColor();
                                            break;
                                        }
                                    }
                                    else
                                    {
                                        Console.WriteLine($"\nОшибка !                                   \n" +
                                                          $"Число \"{rezalt}\" не является шести значным \n" +
                                                          $"Укажите шести значное число                  \n" +
                                                          $"Нажмите Enter чтоб продолжить                  ");
                                        Console.ReadLine();

                                    }
                                }
                                catch (Exception)
                                {
                                    Console.WriteLine("Ошибка ! укажите шести значное число ");
                                    Console.ReadLine();

                                }
                            }


                            break;

                        default:
                            Console.WriteLine("Ошибка:");
                            break;
                    }
                }
                catch (Exception)
                {
                    Console.WriteLine("Ошибка:");
                    Console.ReadLine();
                }
            }

        }
    }
}

