using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace dz_8_dop
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Перегрузка методов
            //алгоритмы с рекурсией
            //ref, out
            //Дополнительные задания:
            //Задание 1.
            //Написать рекурсивную функцию нахождения степени числа.
            //Задание 2.
            //Написать рекурсивную функцию, выводящую N звезд в ряд, число N задает пользователь.
            //Проиллюстрируйте работу функции примером. (Протестировать функцию).
            //Задание 3.
            //Написать рекурсивную функцию, исчисляющую сумму всех чисел в диапазоне от a до b. 
            //Пользователь вводит a и b.Проиллюстрируйте работу функции примером. (Протестировать функцию).
            //Задание 4.
            //Напишите рекурсивную функцию, принимающую одномерный массив из 100 целых чисел заполненных случайным 
            //образом и находящую позицию, с которой начинается последовательность из 10 чисел, сумма которых минимальна.
        }
    }
}
