using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace dz_0_dop
{
    internal class Program
    {
        static void Main(string[] args)
        { 
        //dz #2
        //Задание 4.
        //Пользователь вводит с клавиатуры размер одного файла в гигабайтах и ​​скорость подключения
        //Интернету в битах в секунду. Посчитать, за сколько часов, минут и секунд скачается фильм.


        //dz #3
        //Дополнительные задачи:
        //1.Зарплата менеджера составляет 200$ +процент от продаж, продажи до 500$ – 3 %, от 500 до 1000 – 5 %, свыше 1000 – 8 %.
        //Пользователь вводит с клавиатуры уровень продаж для трех менеджеров.
        //Определить их зарплату, определить лучшего менеджера, начислить ему премию 200$,
        //вывести итоги на экран
        //Примечание: уровень продаж у всех трех менеджеров разный.
        //2.Пользователь вводит шестизначное число.Необходимо изменить в том числе первую и шестую цифры,
        //а также вторую и пятую цифры. Например, 723895 преобразуется в 593827.Если пользователь ввел не
        //шестизначное число, нужно вывести сообщение об ошибке.
        //3.Пользователь вводит номер месяца с клавиатуры(от 1 до 12).В зависимости от полученного номера
        //месяца программа выводит на экран надпись: Winter(если введено значение 1, 2 или 12), Spring(если введено значение от 3 до 5), 
        //Summer(если введено значение от 6 до 8), Autumn(если введено значение от 9 до 11).Если пользователь ввел значение не в диапазоне
        //от 1 до 12, необходимо вывести сообщение об ошибке.
        //4.Написать программу подсчета стоимости разговора для разных мобильных операторов. Пользователь вводит стоимость разговора и выбирает 
        //из какого оператора он звонит.Вывести стоимость на экран.


        //dz #5
        //Дополнительные задачи:
        //1.Подсчитать количество целых чисел в диапазоне от 100 до 999 у которых есть две одинаковые цифры.
        //2.Показать все простые числа в диапазоне, указанном пользователем.
        //Число называется простым, если оно делится без остатка только на себя и единицу.
        //Например, три – это простое число, а четыре – нет.
        //Важно:
        //Во всех задачах и последующих дз – пытаться использовать обработку исключений.
        //Если возникают проблемы в логике программы – пользуйтесь дебаггером.


        //dz #6
        //Массивы:
        //Напишите приложение, которое создает двухмерный массив и заполняет его по следующему принципу:
        //пользователь вводит число(например, 3) первый элемент массива приобретает значение этого числа,
        //следующий элемент массива приобретает значение этого числа + 1(т.е. 4 для нашего примера), 
        //третий элемент массива предварительный элемент + 1(т.е. 5 для примера).Созданный массив вывести на экран.


        }
    }
}
